'''Практически каждый человек знаком с финансовыми инвестициями, целью которых является преумножение имеющихся средств в течение некоторого времени. Наиболее простым примером является банковский вклад, который ежегодно увеличивается путем начисления на него определенного числа процентов. Составляющими такого банковского вклада являются начальная сумма вклада, процентная ставка и срок вклада.

Чтобы понять, каким образом меняется размер вклада и происходит начисление процентов, рассмотрим следующую задачу: Вкладчик открыл счёт в банке, разместив сумму в
120
000
120000 рублей под
10
%
10% годовых. Какая сумма будет на счёте через
3
3 года?'''

from itertools import accumulate,repeat
from operator import mul

def annual_return(start, percent, year): # вспоминаю итераторы
    iter = accumulate(repeat(1 + percent/100, year), mul, initial=start)
    next(iter)
    return iter

