'''Будем считать, что игровое поле для игры в дартс представляет собой квадратную матрицу, заполненную натуральными числами, расположенными в порядке возрастания от краев к центру. Стороной игрового поля будем называть сторону квадратной матрицы, которую представляет это поле.

Напишите программу, которая создает поле для игры в дартс определенного размера.

Формат входных данных
На вход программе подается единственное натуральное число — сторона игрового поля.

Формат выходных данных
Программа должна создать и вывести игровое поле с заданной стороной.git'''
n = int(input())


matrix = []
if n % 2:
    maxx = n // 2 + 1
else:
    maxx = n // 2

for i in range(1, maxx + 1):
    lst = []
    k = 1
    for j in range(maxx):
        lst.append(k)
        if k != i:
            k += 1
    else:
        if n % 2:
            lst += lst[-2::-1]
        else:
            lst += lst[::-1]
        matrix.append(lst)
else:
    if n % 2:
        matrix += matrix[-2:: -1]
    else:
        matrix += matrix[::-1]

for i in matrix:
    print(*i)




