"""
Реализуйте класс данных Point, описывающий точку на координатной плоскости. При создании экземпляра класс должен принимать два аргумента в следующем порядке:

x — координата точки по оси
x
x (тип float), по умолчанию имеет значение 0.0
y — координата точки по оси
y
y (тип float), по умолчанию имеет значение 0.0
Экземпляр класса Point должен иметь три атрибута:

x — координата точки по оси
x
x
y — координата точки по оси
y
y
quadrant — координатная четверть, к которой принадлежит точка (тип int). Если точка лежит на одной из осей, координатная четверть считается равной 0
Класс Point должен иметь два метода экземпляра:

symmetric_x() — метод, возвращающий новый экземпляр класса Point, представляющий точку, симметричную текущей точке относительно оси
x
x
symmetric_y() — метод, возвращающий новый экземпляр класса Point, представляющий точку, симметричную текущей точке относительно оси
y
y
Экземпляр класса Point должен иметь следующее формальное строковое представление:

Point(x=<координата x>, y=<координата y>, quadrant=<координатная четверть>)
Наконец, экземпляры класса Point должны поддерживать между собой операцию сравнения с помощью операторов == и!=. Две точки считаются равными, если их координаты по обеим осям совпадают.

Примечание 1. Для точки с координатами
(
x
,
y
)
(x,y) симметричной относительно оси
x
x будем считать точку с координатами
(
x
,
−
y
)
(x,−y), симметричной относительно оси
y
y — точку с координатами
(
−
x
,
y
)
(−x,y).
"""


from dataclasses import dataclass,field


@dataclass
class Point:
    x: float = 0.0
    y: float = 0.0

    def __post_init__(self):
        if self.x > 0 and self.y > 0:
            self.quadrant = 1
        elif self.x < 0 and self.y > 0:
            self.quadrant = 2
        elif self.x < 0 and self.y < 0:
            self.quadrant = 3
        elif self.x > 0 and self.y < 0:
            self.quadrant = 4
        else:
            self.quadrant = 0

    def symmetric_x(self):
        return Point(self.x, -self.y)

    def symmetric_y(self):
        return Point(-self.x, self.y)

    def __repr__(self):
        return f"Point(x={self.x}, y={self.y}, quadrant={self.quadrant})"


point1 = Point(1, 2)
point2 = Point(1, 2)
point3 = Point(3, 4)

print(point1 == point2)
print(point1 == point3)
print(point2 != point3)