"""Реализуйте класс QuadraticPolynomial, описывающий квадратный трехчлен. При создании экземпляра класс должен принимать три аргумента в следующем порядке:

a — коэффициент
a
a квадратного трехчлена
b — коэффициент
b
b квадратного трехчлена
c — коэффициент
c
c квадратного трехчлена
Экземпляр класса QuadraticPolynomial должен являться вызываемым объектом и принимать один аргумент:

x — число
Экземпляр класса QuadraticPolynomial должен возвращать значение выражения
a
x
2
+
b
x
+
c
ax
2
 +bx+c, где
a
,
b
a,b и
c
c — коэффициенты квадратного трехчлена.

Примечание 1. Дополнительная проверка данных на корректность не требуется. Гарантируется, что реализованный класс используется только с корректными данными.

Примечание 2. Никаких ограничений касательно реализации класса QuadraticPolynomial нет, она может быть произвольной.

Примечание 3. Тестовые данные доступны по ссылкам:"""

class QuadraticPolynomial:

    def __init__(self, a, b, c):
        self.a = a
        self.b = b
        self.c = c

    def __call__(self, x):
        return self.a * x ** 2 + self.b * x + self.c