"""
Декоратор @limiter🌶️🌶️
Любой пользовательский класс по умолчанию способен создавать бесконечное количество собственных экземпляров. Шаблон проектирования синглтон, напротив, гарантирует, что класс имеет только один собственный экземпляр, и при попытке создать новый, он возвращает уже имеющийся.

Реализуйте декоратор @limiter для декорирования класса, с помощью которого можно ограничивать количество создаваемых декорируемым классом экземпляров до определенного числа. Декоратор должен принимать три аргумента в следующем порядке:

limit — количество экземпляров, которое может создать декорируемый класс
unique — имя атрибута экземпляра декорируемого класса, значение которого является его идентификатором. Два экземпляра с одинаковыми идентификаторами существовать не могут. Если происходит попытка создать экземпляр, идентификатор которого совпадает с идентификатором одного из ранее созданных экземпляров, должен быть возвращен этот ранее созданный экземпляр
lookup — определяет, какой объект должен быть возвращен, если превышено ограничение limit, а значение атрибута unique ранее не использовалось. При значении FIRST возвращается самый первый созданный экземпляр, при значении LAST — самый последний созданный экземпляр
Примечание 1. Гарантируется, что экземпляры декорируемого класса всегда имеют атрибут, который содержит их идентификатор.
"""
import functools

def limiter(limit, unique, lookup):
    instances = {}
    lookups = {"LAST": -1, "FIRST": 0}

    def wrapper(cls):
        old_new = cls.__new__
        old_init = cls.__init__

        @functools.wraps(old_new)
        def new_new(cls, *args, **kwargs):
            new_instance = old_new(cls)
            old_init(new_instance, *args, **kwargs)
            new_key = getattr(new_instance, unique)
            if new_key in instances:
                del new_instance
                new_instance = instances[new_key]
            else:
                if len(instances) < limit:
                    instances[new_key] = new_instance
                else:
                    del new_instance
                    new_instance = tuple(instances.values())[lookups[lookup]]
            return new_instance

        cls.__new__ = new_new
        cls.__init__ = object.__init__
        return cls
    return wrapper


@limiter(2, 'ID', 'FIRST')
class MyClass:
    def __init__(self, ID, value):
        self.ID = ID
        self.value = value

obj1 = MyClass(1, 5)          # создается экземпляр класса с идентификатором 1
obj2 = MyClass(2, 8)          # создается экземпляр класса с идентификатором 2

obj3 = MyClass(1, 20)         # возвращается obj1, так как экземпляр с идентификатором 1 уже есть
obj4 = MyClass(3, 0)          # превышено ограничение limit, возвращается первый созданный экземпляр

print(obj3.value)
print(obj4.value)
