'''Класс Vector
Реализуйте класс Vector, описывающий вектор на плоскости. При создании экземпляра класс должен принимать два аргумента в следующем порядке:

x — координата вектора по оси
𝑥
x, по умолчанию имеет значение 0
y — координата вектора по оси
𝑦
y, по умолчанию имеет значение 0
Экземпляр класса Vector должен иметь два атрибута:

x — координата вектора по оси
𝑥
x
y — координата вектора по оси
𝑦
y
Класс Vector должен иметь один метод экземпляра:

abs() — метод, возвращающий модуль вектора
Примечание 1. Модуль вектора с координатами
(
𝑥
,
𝑦
)
(x,y) вычисляется по формуле
𝑥
2
+
𝑦
2
x
2
 +y
2

​
 .

Примечание 2. Дополнительная проверка данных на корректность не требуется. Гарантируется, что реализованный класс используется только с корректными данными.

Примечание 3. Тестовые данные доступны по ссылкам:'''
import math
class Vector:
    def __init__(self, x = 0, y= 0):
        self.x = x
        self.y = y
    def abs(self):
        return math.sqrt(self.x ** 2 + self.y ** 2)