'''вадратный трехчлен – это многочлен вида
𝑎
𝑥
2
+
𝑏
𝑥
+
𝑐
ax
2
 +bx+c, где
𝑎
≠
0
a

=0. Например:
𝑥
2
+
1
𝑥
2
−
5
𝑥
+
6
x
2
 +1
x
2
 −5x+6
Значение переменной
𝑥
x, при котором квадратный трехчлен обращается в ноль, называют его корнем. Квадратный трехчлен может иметь один корень, два корня или вовсе не иметь корней. Корни квадратного трехчлена, если они существуют, находятся по формуле:
𝑥
1
,
2
=
−
𝑏
±
𝑏
2
−
4
𝑎
𝑐
2
𝑎
x
1,2
​
 =
2a
−b±
b
2
 −4ac
​

​

Реализуйте класс QuadraticPolynomial, описывающий квадратный трехчлен. При создании экземпляра класс должен принимать три аргумента в следующем порядке:

a — коэффициент
𝑎
a квадратного трехчлена
b — коэффициент
𝑏
b квадратного трехчлена
c — коэффициент
𝑐
c квадратного трехчлена
Экземпляр класса QuadraticPolynomial должен иметь три атрибута:

a — коэффициент
𝑎
a квадратного трехчлена
b — коэффициент
𝑏
b квадратного трехчлена
c — коэффициент
𝑐
c квадратного трехчлена
Класс QuadraticPolynomial должен иметь четыре свойства:

x1 — свойство, доступное только для чтения, возвращающее корень квадратного трехчлена, вычисленный по формуле:
𝑥
1
=
−
𝑏
−
𝑏
2
−
4
𝑎
𝑐
2
𝑎
x
1
​
 =
2a
−b−
b
2
 −4ac
​

​

Если квадратный трехчлен не имеет корней (
𝑏
2
−
4
𝑎
𝑐
<
0
b
2
 −4ac<0), значением свойства должно быть значение None
x2 — свойство, доступное только для чтения, возвращающее корень квадратного трехчлена, вычисленный по формуле:
𝑥
2
=
−
𝑏
+
𝑏
2
−
4
𝑎
𝑐
2
𝑎
x
2
​
 =
2a
−b+
b
2
 −4ac
​

​

Если квадратный трехчлен не имеет корней (
𝑏
2
−
4
𝑎
𝑐
<
0
b
2
 −4ac<0), значением свойства должно быть значение None
view — свойство, доступное только для чтения, возвращающее строку вида:
ax^2 + bx + c
где a, b и с представляют коэффициенты квадратного трехчлена

coefficients — свойство, доступное для чтения и записи, возвращающее кортеж вида:
(a, b, c)
где a, b и с представляют коэффициенты квадратного трехчлена
Примечание 1. Если квадратный трехчлен имеет лишь один корень, значения свойств x1 и x2 должны совпадать.

Примечание 2. При изменении коэффициентов квадратного трехчлена через соответствующие атрибуты или свойство coefficients значения свойств x1, x2, view и coefficients также должны изменяться.

Примечание 3. Если какие-либо коэффициенты квадратного трехчлена равны нулю, они по-прежнему должны присутствовать в строке, возвращаемой свойством view, дополнительно их убирать не нужно.

Примечание 4. Дополнительная проверка данных на корректность не требуется. Гарантируется, что реализованный класс используется только с корректными данными.

Примечание 5. Никаких ограничений касательно реализации класса QuadraticPolynomial нет, она может быть произвольной.'''

class QuadraticPolynomial:
    def __init__(self, *args):
        self.coefficients = args


    @property
    def x1(self):
        k = (self.b ** 2 - 4 * self.a * self.c)
        if k < 0:
            return None
        else:
            return (-self.b - k ** 0.5) / (2 * self.a)

    @property
    def x2(self):
        k = (self.b ** 2 - 4 * self.a * self.c)
        if k < 0:
            return None
        else:
            return (-self.b + k ** 0.5) / (2 * self.a)

    @property
    def view(self):
        return f'{self.a}x^2 {["-", "+"][self.b >= 0]} {abs(self.b)} {["-", "+"][self.c >= 0]} {abs(self.c)}'

    @property
    def coefficients(self):
        return (self.a, self.b, self.c)

    @coefficients.setter
    def coefficients(self, args):
        self.a, self.b, self.c = args


polynom = QuadraticPolynomial(1, 2, -3)

polynom.coefficients = (1, -5, 0)
print(polynom.x1)
print(polynom.x2)
print(polynom.view)