'''Реализуйте класс Circle, описывающий круг. При создании экземпляра класс должен принимать один аргумент:

radius — радиус круга
Экземпляр класса Circle должен иметь три атрибута:

_radius — радиус круга
_diameter — диаметр круга
_area — площадь круга
Класс Circle должен иметь три метода экземпляра:

get_radius() — метод, возвращающий радиус круга
get_diameter() — метод, возвращающий диаметр круга
get_area() — метод, возвращающий площадь круга
Примечание 1. Площадь круга вычисляется по формуле
𝜋
𝑟
2
πr
2
 , где
𝑟
r — радиус круга,
𝜋
π — константа, которая выражает отношение длины окружности к ее диаметру.

Примечание 2. Импортировать константу
𝜋
π можно из модуля math:

from math import pi
Примечание 3. Дополнительная проверка данных на корректность не требуется. Гарантируется, что реализованный класс используется только с корректными данными.

Примечание 4. Тестовые данные доступны по ссылкам:'''

import math
class Circle:
    def __init__(self, radius):
        self._radius = radius
        self._diameter = radius * 2
        self._area = math.pi * math.pow(radius, 2)

    def get_radius(self):
        return self._radius
    def get_diameter(self):
        return self._diameter
    def  get_area(self):
        return self._area
