"""Элементы дерева называются узлами. На рисунке выше узлами являются значения 8, 3, 1, 6, 4, 7, 10, 14 и 13. Узлы без потомков называются листьями. На рисунке выше листьями являются значения 1, 4, 7 и 13.

Реализуйте класс TreeBuilder. При создании экземпляра класс не должен принимать никаких аргументов.

Экземпляр класса TreeBuilder должен являться реентерабельным контекстным менеджером, который позволяет пошагово строить древовидную структуру данных (дерево).

Класс TreeBuilder должен иметь два метода экземпляра:

add() — метод, принимающий в качестве аргумента произвольный объект (лист) и добавляющий его в текущий узел дерева
structure() — метод, возвращающий структуру дерева в виде вложенных списков
Добавление узлов в дерево должно происходить с помощью оператора with. Узел считается текущим в рамках своего блока with. Если в узел не было добавлено ни одного листа, то этот узел не должен появляться в структуре дерева, возвращаемой методом structure()."""


class TreeBuilder:
    def __init__(self):
        self.knots = [[]]

    def __enter__(self):
        self.knots.append([])

    def __exit__(self, *args, **kwargs):
        if self.knots[-1]:
            self.knots[-2].append(self.knots[-1])
        self.knots.pop()

    def add(self, value):
        self.knots[-1].append(value)

    def structure(self):
        return self.knots[-1]
